Feature: Управління посадкою та бронюванням столів
  Як зареєстрований клієнт або адміністратор ресторану
  Я хочу бронювати столи та керувати посадкою відвідувачів
  Щоб гарантувати наявність вільних місць та організувати комфортне розміщення гостей

  Background:
    Given користувач зареєстрований у системі з роллю "CLIENT"

  Scenario: Автоматичний вибір вільного столу системою при бронюванні
    When клієнт оформлює бронювання на дату, час, кiлькiсть гостей без вибору конкретного столу
      And підтверджує створення бронювання
    Then система бронює будь-який підходящий вільний стіл на цей час
      And статус обраного столу переходить у "Заброньовано" на вказаний інтервал
      And клієнт отримує підтвердження успішного бронювання в застосунку

  Scenario: Ручний вибір конкретного столу клієнтом
    Given стіл <номер> має статус "Вільний" на обрану дату i час
    When клієнт обирає дату, час, кiлькiсть гостей та стіл <номер> зі списку доступних
      And підтверджує створення бронювання
    Then система бронює саме стіл <номер> на цей інтервал часу
      And статус столу <номер> переходить у стан "Заброньовано"
      And клієнт отримує підтвердження успішного бронювання

  Scenario: Відсутність вільних столів у залі на обраний час
    Given усі столи в залі зайняті або заброньовані
    When клієнт обирає дату та час для бронювання
    Then система сповіщає клієнта в застосунку про відсутність вільних столів
      And система пропонує інші доступні варіанти дат або інтервалів часу

  Scenario: Відхилення бронювання при перевищенні ліміту в 3 столи
    When клієнт намагається обрати 4 столи в межах одного бронювання
    Then система блокує створення бронювання
      And відображає повідомлення про помилку: "Максимальна кількість столів для одного бронювання: 3"

  Scenario: Скасування бронювання клієнтом
    Given клієнт має активне бронювання зі закріпленим столом <номер>
    When клієнт скасовує це бронювання до початку заброньованого часу
    Then система переводить стіл <номер> у статус "Вільний" на цей період
    And система надсилає повідомлення клієнту про успішне скасування бронювання

  Scenario: Посадка гостей за живою чергою адміністратором
    Given адміністратор "ADMIN" переглядає інтерактивну карту залу в реальному часі
      And стіл <номер> має статус "Вільний"
    When до закладу прибуває компанія гостей без попередньої броні
      And адміністратор закріплює за ними стіл <номер> на карті залу
    Then система негайно переводить статус столу <номер> у стан "Зайнятий"
    And інтерактивна карта залу миттєво відображає стіл <номер> зайнятим
